In [4]:
df["Airline"].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [5]:
df["Day"]=df["Date_of_Journey"].dt.day
df["Month"]=df["Date_of_Journey"].dt.month
df["Year"]=df["Date_of_Journey"].dt.year

In [6]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day,Month,Year
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,22:20:00,2023-03-22 01:10:00,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,2019-05-01,Kolkata,Banglore,CCU ? IXR ? BBI ? BLR,05:50:00,13:15:00,7h 25m,2 stops,No info,7662,1,5,2019
2,Jet Airways,2019-06-09,Delhi,Cochin,DEL ? LKO ? BOM ? COK,09:25:00,2023-06-10 04:25:00,19h,2 stops,No info,13882,9,6,2019
3,IndiGo,2019-05-12,Kolkata,Banglore,CCU ? NAG ? BLR,18:05:00,23:30:00,5h 25m,1 stop,No info,6218,12,5,2019
4,IndiGo,2019-03-01,Banglore,New Delhi,BLR ? NAG ? DEL,16:50:00,21:35:00,4h 45m,1 stop,No info,13302,1,3,2019

In [7]:
df.drop("Date_of_Journey",axis=1,inplace=True)

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
df = pd.read_excel("Data_Train1.xlsx")
df

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,22:20:00,2023-03-22 01:10:00,2h 50m,non-stop,No info,3897
1,Air India,2019-05-01,Kolkata,Banglore,CCU ? IXR ? BBI ? BLR,05:50:00,13:15:00,7h 25m,2 stops,No info,7662
2,Jet Airways,2019-06-09,Delhi,Cochin,DEL ? LKO ? BOM ? COK,09:25:00,2023-06-10 04:25:00,19h,2 stops,No info,13882
3,IndiGo,2019-05-12,Kolkata,Banglore,CCU ? NAG ? BLR,18:05:00,23:30:00,5h 25m,1 stop,No info,6218
4,IndiGo,2019-03-01,Banglore,New Delhi,BLR ? NAG ? DEL,16:50:00,21:35:00,4h 45m,1 stop,No info,13302
...,...,...,...,...,...,...,...,...,...,...,...
10678,Air Asia,2019-04-09,Kolkata,Banglore,CCU ? BLR,19:55:00,22:25:00,2h 30m,non-stop,No info,4107
10679,Air India,2019-04-27,Kolkata,Banglore,CCU ? BLR,20:45:00,23:20:00,2h 35m,non-stop,No info,4145
10680,Jet Airways,2019-04-27,Banglore,Delhi,BLR ? DEL,08:20:00,11:20:00,3h,non-stop,No info,7229
10681,Vistara,2019-03-01,Banglore,New Delhi,BLR ? DEL,11:30:00,14:10:00,2h 40m,non-stop,No info,12648
10682,Air India,2019-05-09,Delhi,Cochin,DEL ? GOI ? BOM ? COK,10:55:00,19:15:00,8h 20m,2 stops,No info,11753

In [9]:
df["Arrival_Time"]=df["Arrival_Time"].astype("str")

In [10]:
df["Arrival_Hour"]=df["Arrival_Time"].str.split(":").str[0]
df["Arrival_Min"]=df["Arrival_Time"].str.split(":").str[1]
df.drop("Arrival_Time",axis=1,inplace=True)

In [11]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,22:20:00,2h 50m,non-stop,No info,3897,2023-03-22 01,10

In [12]:
df["Dep_Time"]=df["Dep_Time"].astype("str")

In [13]:
df["Dept_Hour"]=df["Dep_Time"].str.split(":").str[0]
df["Dept_Min"]=df["Dep_Time"].str.split(":").str[1]
df.drop("Dep_Time",axis=1,inplace=True)

In [14]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,non-stop,No info,3897,2023-03-22 01,10,22,20

In [15]:
df["Date_of_Journey"]=df["Date_of_Journey"].astype("str")

In [16]:
df["Date_of_Journey"].dtype

dtype('O')

In [17]:
df["Day"]=df["Date_of_Journey"].dt.day
df["Month"]=df["Date_of_Journey"].dt.month
df["Year"]=df["Date_of_Journey"].dt.year

AttributeError: Can only use .dt accessor with datetimelike values

In [ ]:
df.head(1)

In [ ]:
df["Total_Stops"].unique()

In [ ]:
df[df["Total_Stops"].isnull()]

# converting the Total_Stops column into integers using map function

In [20]:
df["Total_Stops"]=df["Total_Stops"].map({"non-stop":0,"1 stop":1,"2 stops":2,"3 stops":3,"4 stops":4,"nan":1})

In [21]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,0.0,No info,3897,2023-03-22 01,10,22,20
1,Air India,2019-05-01,Kolkata,Banglore,CCU ? IXR ? BBI ? BLR,7h 25m,2.0,No info,7662,13,15,05,50
2,Jet Airways,2019-06-09,Delhi,Cochin,DEL ? LKO ? BOM ? COK,19h,2.0,No info,13882,2023-06-10 04,25,09,25
3,IndiGo,2019-05-12,Kolkata,Banglore,CCU ? NAG ? BLR,5h 25m,1.0,No info,6218,23,30,18,05
4,IndiGo,2019-03-01,Banglore,New Delhi,BLR ? NAG ? DEL,4h 45m,1.0,No info,13302,21,35,16,50

In [22]:
df["Total_Stops"].unique()

array([ 0.,  2.,  1.,  3., nan,  4.])

In [23]:
df[df["Total_Stops"].isnull()]

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min
9039,Air India,2019-05-06,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480,2023-05-07 09,25,09,45

In [24]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,0.0,No info,3897,2023-03-22 01,10,22,20

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  float64
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   Arrival_Hour     10683 non-null  object
 10  Arrival_Min      10683 non-null  object
 11  Dept_Hour        10683 non-null  object
 12  Dept_Min         10683 non-null  object
dtypes: float64(1), int64(1), object(11)
memory usage: 1.1+ MB

In [28]:
df["Dept_Hour"]=df["Dept_Hour"].astype("int")

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  float64
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   Arrival_Hour     10683 non-null  object
 10  Arrival_Min      10683 non-null  object
 11  Dept_Hour        10683 non-null  int32
 12  Dept_Min         10683 non-null  object
dtypes: float64(1), int32(1), int64(1), object(10)
memory usage: 1.0+ MB

In [30]:
df["Dept_Min"]=df["Dept_Min"].astype("int")

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Duration         10683 non-null  object
 6   Total_Stops      10682 non-null  float64
 7   Additional_Info  10683 non-null  object
 8   Price            10683 non-null  int64
 9   Arrival_Hour     10683 non-null  object
 10  Arrival_Min      10683 non-null  object
 11  Dept_Hour        10683 non-null  int32
 12  Dept_Min         10683 non-null  int32
dtypes: float64(1), int32(2), int64(1), object(9)
memory usage: 1001.7+ KB

In [32]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,0.0,No info,3897,2023-03-22 01,10,22,20

In [35]:
df["Duration_Hour"]=df["Duration"].str.split(" ").str[0].str.split("h").str[0]

In [36]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min,Duration_Hour
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,0.0,No info,3897,2023-03-22 01,10,22,20,2

In [37]:
df["Duration_Hour"]

0         2
1         7
2        19
3         5
4         4
         ..
10678     2
10679     2
10680     3
10681     2
10682     8
Name: Duration_Hour, Length: 10683, dtype: object

In [38]:
df["Duration_Min"]=df["Duration"].str.split(" ").str[1].str.split("m").str[0]

In [40]:
df["Duration_Min"].fillna(0)

0        50
1        25
2         0
3        25
4        45
         ..
10678    30
10679    35
10680     0
10681    40
10682    20
Name: Duration_Min, Length: 10683, dtype: object

In [41]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min,Duration_Hour,Duration_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,2h 50m,0.0,No info,3897,2023-03-22 01,10,22,20,2,50

In [42]:
df.drop("Duration",axis=1,inplace=True)

In [43]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min,Duration_Hour,Duration_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,0.0,No info,3897,2023-03-22 01,10,22,20,2,50

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Total_Stops      10682 non-null  float64
 6   Additional_Info  10683 non-null  object
 7   Price            10683 non-null  int64
 8   Arrival_Hour     10683 non-null  object
 9   Arrival_Min      10683 non-null  object
 10  Dept_Hour        10683 non-null  int32
 11  Dept_Min         10683 non-null  int32
 12  Duration_Hour    10683 non-null  object
 13  Duration_Min     9651 non-null   object
dtypes: float64(1), int32(2), int64(1), object(10)
memory usage: 1.1+ MB

In [62]:
df["Duration_Hour"]=df["Duration_Hour"].astype("int")

In [63]:
df[df["Duration_Hour"]=="5m"]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Route, Total_Stops, Additional_Info, Price, Arrival_Hour, Arrival_Min, Dept_Hour, Dept_Min, Duration_Hour, Duration_Min]
Index: []

# After droping the column of no.6474 it is showing error

In [64]:
df.drop(6474,axis=0,inplace=True)

KeyError: '[6474] not found in axis'

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Date_of_Journey  10682 non-null  object
 2   Source           10682 non-null  object
 3   Destination      10682 non-null  object
 4   Route            10681 non-null  object
 5   Total_Stops      10681 non-null  float64
 6   Additional_Info  10682 non-null  object
 7   Price            10682 non-null  int64
 8   Arrival_Hour     10682 non-null  object
 9   Arrival_Min      10682 non-null  object
 10  Dept_Hour        10682 non-null  int32
 11  Dept_Min         10682 non-null  int32
 12  Duration_Hour    10682 non-null  int32
 13  Duration_Min     9651 non-null   object
dtypes: float64(1), int32(3), int64(1), object(9)
memory usage: 1.4+ MB

In [66]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min,Duration_Hour,Duration_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,0.0,No info,3897,2023-03-22 01,10,22,20,2,50

In [85]:
df["Duration_Min"]=df["Duration_Min"].astype("int")

In [76]:
df[df["Duration_Min"]=="nan"]

Empty DataFrame
Columns: [Airline, Date_of_Journey, Source, Destination, Route, Total_Stops, Additional_Info, Price, Arrival_Hour, Arrival_Min, Dept_Hour, Dept_Min, Duration_Hour, Duration_Min]
Index: []

In [81]:
df["Duration_Min"]=df["Duration_Min"].fillna(0)

In [77]:
df["Duration_Min"].dtype

dtype('O')

In [82]:
df["Duration_Min"].head(100)

0     50
1     25
2      0
3     25
4     45
      ..
95    25
96    40
97     0
98    25
99    35
Name: Duration_Min, Length: 100, dtype: object

In [87]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Date_of_Journey  10682 non-null  object
 2   Source           10682 non-null  object
 3   Destination      10682 non-null  object
 4   Route            10681 non-null  object
 5   Total_Stops      10681 non-null  float64
 6   Additional_Info  10682 non-null  object
 7   Price            10682 non-null  int64
 8   Arrival_Hour     10682 non-null  object
 9   Arrival_Min      10682 non-null  object
 10  Dept_Hour        10682 non-null  int32
 11  Dept_Min         10682 non-null  int32
 12  Duration_Hour    10682 non-null  int32
 13  Duration_Min     10682 non-null  int32
dtypes: float64(1), int32(4), int64(1), object(8)
memory usage: 1.3+ MB

In [86]:
df["Duration_Min"].dtype

dtype('int32')

# checking the average price among the all airlines

In [88]:
df.head(2)

,Airline,Date_of_Journey,Source,Destination,Route,Total_Stops,Additional_Info,Price,Arrival_Hour,Arrival_Min,Dept_Hour,Dept_Min,Duration_Hour,Duration_Min
0,IndiGo,2019-03-24,Banglore,New Delhi,BLR ? DEL,0.0,No info,3897,2023-03-22 01,10,22,20,2,50
1,Air India,2019-05-01,Kolkata,Banglore,CCU ? IXR ? BBI ? BLR,2.0,No info,7662,13,15,5,50,7,25

In [91]:
df.groupby("Airline")["Price"].mean().sort_values()

Airline
Trujet                                4140.000000
SpiceJet                              4338.284841
Air Asia                              5590.260188
IndiGo                                5673.682903
GoAir                                 5861.056701
Vistara                               7796.348643
Vistara Premium economy               8962.333333
Air India                             9606.804112
Multiple carriers                    10902.678094
Multiple carriers Premium economy    11418.846154
Jet Airways                          11643.923357
Jet Airways Business                 58358.666667
Name: Price, dtype: float64